In [107]:
'''
%pip install psycopg2
%pip install ipython-sql
%pip install matplotlib
%matplotlib inline
'''

'\n%pip install psycopg2\n%pip install ipython-sql\n%pip install matplotlib\n%matplotlib inline\n'

In [108]:
import psycopg2 as ps2
import pandas as pnd
from sqlalchemy import create_engine

In [109]:
%load_ext sql
%sql postgresql://shophost:123454321@localhost/inetshop

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [110]:
%%sql CREATE TABLE worker (
    id SERIAL PRIMARY KEY, 
    email VARCHAR(20) NOT NULL UNIQUE, 
    fst_name VARCHAR(20) NOT NULL, 
    snd_name VARCHAR(20) NOT NULL
);

 * postgresql://shophost:***@localhost/inetshop
Done.

[]

In [111]:
%%sql INSERT INTO worker(email, fst_name, snd_name)
VALUES
('II@sql.py', 'Ivan', 'Ivanov'),
('VladCentral@sql.py', 'Mihail', 'Krug'),
('OK@sql.py', 'Oleg', 'Korobov'),
('PT@sql.py', 'Pavel', 'Tarsov')

 * postgresql://shophost:***@localhost/inetshop
4 rows affected.

[]

In [112]:
%%sql CREATE TABLE product (
    id SERIAL PRIMARY KEY,
    name VARCHAR(20) NOT NULL UNIQUE, 
    price MONEY NOT NULL
);

 * postgresql://shophost:***@localhost/inetshop
Done.

[]

In [113]:
%%sql INSERT INTO product (name, price)
VALUES
('Repair kit', 5000),
('Shirt', 500),
('Shoes', 1500),
('Energetic', 100)

 * postgresql://shophost:***@localhost/inetshop
4 rows affected.

[]

In [114]:
%%sql CREATE TABLE customer (
    id SERIAL PRIMARY KEY,
    fst_name VARCHAR(20) NOT NULL,
    snd_name VARCHAR(20) NOT NULL
);

 * postgresql://shophost:***@localhost/inetshop
Done.

[]

In [115]:
%%sql INSERT INTO customer (fst_name, snd_name)
VALUES
('Artem', 'Burah'),
('Daniil', 'Dankovskiy'),
('Vladisla', 'Olgimskiy')

 * postgresql://shophost:***@localhost/inetshop
3 rows affected.

[]

In [116]:
%%sql CREATE TABLE orders (
    id SERIAL PRIMARY KEY,
    date TIMESTAMP NOT NULL,
    customer_id SERIAL NOT NULL,
    product_name TEXT NOT NULL,
    quanity INT NOT NULL,
    FOREIGN KEY (customer_id) REFERENCES customer (id),
    FOREIGN KEY (product_name) REFERENCES product (name)
);

 * postgresql://shophost:***@localhost/inetshop
Done.

[]

In [117]:
%%sql INSERT INTO orders (date, customer_id, product_name, quanity)
VALUES
('2023-04-15', 1, 'Repair kit', 1),
('2023-04-19', 2, 'Energetic', 5),
('2023-04-13', 2, 'Shirt', 2),
('2023-04-21', 3, 'Shoes', 3),
('2023-04-29', 3, 'Shirt', 7)

 * postgresql://shophost:***@localhost/inetshop
5 rows affected.

[]

In [118]:
%%sql
SELECT product.name, orders.quanity
FROM product
JOIN orders ON orders.product_name = product.name

 * postgresql://shophost:***@localhost/inetshop
5 rows affected.

[('Repair kit', 1), ('Energetic', 5), ('Shirt', 2), ('Shoes', 3), ('Shirt', 7)]

In [119]:
%%sql
SELECT customer.fst_name, customer.snd_name, orders.product_name, orders.quanity
FROM customer
JOIN orders ON customer.id = orders.customer_id

 * postgresql://shophost:***@localhost/inetshop
5 rows affected.

[('Artem', 'Burah', 'Repair kit', 1),
 ('Daniil', 'Dankovskiy', 'Energetic', 5),
 ('Daniil', 'Dankovskiy', 'Shirt', 2),
 ('Vladisla', 'Olgimskiy', 'Shoes', 3),
 ('Vladisla', 'Olgimskiy', 'Shirt', 7)]

In [120]:
%%sql
SELECT orders.date, product.name, orders.quanity
FROM orders
JOIN product ON product.name = orders.product_name

 * postgresql://shophost:***@localhost/inetshop
5 rows affected.

[(datetime.datetime(2023, 4, 15, 0, 0), 'Repair kit', 1),
 (datetime.datetime(2023, 4, 19, 0, 0), 'Energetic', 5),
 (datetime.datetime(2023, 4, 13, 0, 0), 'Shirt', 2),
 (datetime.datetime(2023, 4, 21, 0, 0), 'Shoes', 3),
 (datetime.datetime(2023, 4, 29, 0, 0), 'Shirt', 7)]

In [121]:
'''
%%sql 
DROP TABLE worker;
DROP TABLE orders;
DROP TABLE product;
DROP TABLE customer;
'''

'\n%%sql \nDROP TABLE worker;\nDROP TABLE orders;\nDROP TABLE product;\nDROP TABLE customer;\n'